app/controllers/api/v1/bookings_controller.rb

SELECT "bookings".* FROM "bookings" ORDER BY created_at DESC
---
  def index
    @bookings = Booking.all

INSERT INTO "bookings" ("description", "user_id", "created_at", "updated_at", "car_id", "date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "i want to test the engine"], ["user_id", 29], ["created_at", "2020-12-04 20:26:53.150467"], ["updated_at", "2020-12-04 20:26:53.150467"], ["car_id", 11], ["date", "11/12/2020"]]
---
  def create
    @booking = Booking.new(booking_params)

    if @booking.save