app/controllers/api/v1/cars_controller.rb

  def create
    @user = User.find(params[:user_id])
    if @user.admin == true
      @car = @user.cars.create(car_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
INSERT INTO "cars" ("name", "model", "manufacturer", "category", "created_at", "updated_at", "avatar", "user_id", "speed", "price", "country") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    if @car.update(car_params)
---
UPDATE "cars" SET "avatar" = 'image/upload/v1608119788/kut3cpd90vvaiyani5tn.jpg' WHERE "cars"."id" = $1  [["id", 24]]