app/controllers/application_controller.rb

  def logged_in_user
    if decoded_token # rubocop:disable Style/GuardClause
      user_id = decoded_token[0]['user_id']
      @user = User.find_by(id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]